########################################################################################################################
## Django 自带模块导入
########################################################################################################################
from django.conf.urls import url
from parkservicecms import settings
from django.contrib.staticfiles.urls import staticfiles_urlpatterns

########################################################################################################################
## 系统自带模块导入
########################################################################################################################
from . import views

########################################################################################################################
## 自建模块导入
########################################################################################################################


########################################################################################################################
## url
########################################################################################################################
app_name = 'users'

urlpatterns = [

    # 首页
    url(r'^$',Index.as_view(),name='index'),
    #添加用户
    url(r'add_book$', views.add_book, ),
    url(r'add_user$', views.add_user, ),
    #用户登录
    url(r'^login/$', LoginView.as_view(), name='login'),
    #用户注销
    url(r'^logout/$', LogoutView.as_view(), name='logout'),
    #忘记密码
    url(r'^forget/$', ForgetPasswordView.as_view(), name='forget_password'),
    #查看用户
    url(r'show_books$', views.show_books, ),
    url(r'^user/info/$', UserInfoView.as_view(), name='user_info'),

    # 登录记录
    url(r'^user/login/record/$', UserLoginRecordView.as_view(), name='login_record'),
]